blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org
#+TITLE: GTK Theme Switcher in OCaml: Config File Parsing
#+DATE: <2022-01-28 Fri>
#+SUBTITLE: Code Walktrough – Episodes: [[file:learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org][1]] | [[file:learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org][2]]
#+LANGUAGE: en
#+DESCRIPTION: Writing a GTK Theme Switcher for XFCE4 to toggle light/dark mode via shortcut
#+KEYWORDS: learn ocaml, parsing, config file, dark mode, gtk, xfce, gtk theme, project ideas
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html">
#+SETUPFILE: ../static/setup.org
#+OPTIONS: toc:t

#+begin_center
~ WORK IN PROGRESS ~
#+end_center

Welcome to the 2nd episode of /"We're writing a GTK Theme Switcher for XFCE4 to toggle between light/dark modes via shortcut"/. [[file:learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org][Here's the previous episode]].

* The Config File

Until now, we have "hardcoded" preferences – that means, we specified those preferences within the program code itself – like what is the dark theme, what's the light theme, and which backend we use to talk to the daemon.

Under normal circumstances, this is regarded as quite inconvenient since we'd have to recompile the program every time we would like to change one of those preferences.

There are three common solutions to this "problem":
- Passing the preferences in the form of command line arguments when the program starts
- Defining some environment variables and store the preferences in them
- Specifying the preferences in a plain text file that is read by the program during startup. Those files are called "run control files" (that's why they often end in ="rc"=, eg. =.vimrc=); a.k.a. "dotfiles".

** Is there a Syntax or Convention for Config Files?

There are several formats in use: INI-style files, XML, YAML, S-expressions, and even JSON. But for simplicity's sake, let's stick closely to the [[https://web.archive.org/web/20191007042721/http://www.faqs.org/docs/artu/ch10s03.html][Unix-conventions]]:
- Preferences are specified with key-value pairs
- The =#= character is used as a line comment, so that everything after =#= will be ignored

