blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-04-23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GTK Theme Switcher in OCaml: Config File Parsing</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Writing a GTK Theme Switcher for XFCE4 to toggle light/dark mode via shortcut" />
<meta name="keywords" content="learn ocaml, parsing, config file, dark mode, gtk, xfce, gtk theme, project ideas" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cormorant:wght@300&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Fira+Code:wght@300..700&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="index" href="/index.html">Index</a><a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-03-24">Last updated: 2025-03-24</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">GTK Theme Switcher in OCaml: Config File Parsing</h1>
<p class="subtitle" role="doc-subtitle">Code Walktrough – 2nd Episode</p>
</header><nav class="pager" id="org9112131">
<p>
This post is part of a miniseries:<br>
</p>
<ol class="org-ol">
<li><a href="learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html">Let&rsquo;s Code a GTK Theme Switcher for XFCE in OCaml</a><br></li>
<li><b><a href="learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html">Config File Parsing in OCaml</a></b><br></li>
</ol>
</nav>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org34be515">The Config File</a>
<ul>
<li><a href="#org46f9a5c">Is there a Syntax or Convention for Config Files?</a></li>
<li><a href="#orgaecb6e3">Let&rsquo;s design a beautiful Config File!</a></li>
<li><a href="#org2a82cf4">Where to put this Config File?</a></li>
<li><a href="#orga24ce54">The Config File Path</a></li>
</ul>
</li>
<li><a href="#org7b3259e">Reading a Config File in OCaml</a>
<ul>
<li><a href="#org8e55ac0">Getting the Data from the File</a></li>
<li><a href="#orgf4d3da3">Reading the whole File and building the Data Structure</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div class="org-center">
<p>
~ WORK IN PROGRESS ~<br>
</p>
</div>

<p>
Welcome to the 2nd episode of <i>&ldquo;We&rsquo;re writing a GTK Theme Switcher for XFCE4 to toggle between light/dark modes via shortcut&rdquo;</i>. <a href="learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html">Here&rsquo;s the previous episode</a>.<br>
</p>
<div id="outline-container-org34be515" class="outline-2">
<h2 id="org34be515"><a href="#org34be515">The Config File</a></h2>
<div class="outline-text-2" id="text-org34be515">
<p>
Until now, we have &ldquo;hardcoded&rdquo; preferences – that means, we specified those preferences within the program code itself – like what is the dark theme, what&rsquo;s the light theme, and which backend we use to talk to the daemon.<br>
</p>

<p>
Under normal circumstances, this is regarded as quite inconvenient since we&rsquo;d have to recompile the program every time we would like to change one of those preferences.<br>
</p>

<p>
There are three common solutions to this &ldquo;problem&rdquo;:<br>
</p>
<ul class="org-ul">
<li>Passing the preferences in the form of command line arguments when the program starts<br></li>
<li>Defining some environment variables and store the preferences in them<br></li>
<li>Specifying the preferences in a plain text file that is read by the program during startup. Those files are called &ldquo;run control files&rdquo; (that&rsquo;s why they often end in <code>"rc"</code>, eg. <code>.vimrc</code>); a.k.a. &ldquo;dotfiles&rdquo;.<br></li>
</ul>
</div>
<div id="outline-container-org46f9a5c" class="outline-3">
<h3 id="org46f9a5c"><a href="#org46f9a5c">Is there a Syntax or Convention for Config Files?</a></h3>
<div class="outline-text-3" id="text-org46f9a5c">
<p>
There are several formats in use: INI-style files, XML, YAML, S-expressions, and even JSON. But for simplicity&rsquo;s sake, let&rsquo;s stick closely to the <a href="https://web.archive.org/web/20191007042721/http://www.faqs.org/docs/artu/ch10s03.html">Unix-conventions</a>:<br>
</p>
<ul class="org-ul">
<li>Preferences are specified with key-value pairs<br></li>
<li>The <code>#</code> character is used as a line comment, so that everything after <code>#</code> will be ignored<br></li>
</ul>
</div>
</div>
