blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org
** Let's design a beautiful Config File!

Most important is a huge impressive ASCII art banner to show off your prowess. Besides that, it’s probably a good idea to provide some comments how to use the file. And then there are the actual preferences. Here you go:

#+caption: File =/home/YOUR_USER_NAME/.config/switch_gtk_theme.conf=
#+begin_src conf
  #   █████████  █████   ███   █████ █████ ███████████   █████████  █████   █████
  #  ███░░░░░███░░███   ░███  ░░███ ░░███ ░█░░░███░░░█  ███░░░░░███░░███   ░░███
  # ░███    ░░░  ░███   ░███   ░███  ░███ ░   ░███  ░  ███     ░░░  ░███    ░███
  # ░░█████████  ░███   ░███   ░███  ░███     ░███    ░███          ░███████████
  #  ░░░░░░░░███ ░░███  █████  ███   ░███     ░███    ░███          ░███░░░░░███
  #  ███    ░███  ░░░█████░█████░    ░███     ░███    ░░███     ███ ░███    ░███
  # ░░█████████     ░░███ ░░███      █████    █████    ░░█████████  █████   █████
  #  ░░░░░░░░░       ░░░   ░░░      ░░░░░    ░░░░░      ░░░░░░░░░  ░░░░░   ░░░░░
  #    █████████  ███████████ █████   ████
  #   ███░░░░░███░█░░░███░░░█░░███   ███░
  #  ███     ░░░ ░   ░███  ░  ░███  ███
  # ░███             ░███     ░███████
  # ░███    █████    ░███     ░███░░███
  # ░░███  ░░███     ░███     ░███ ░░███
  #  ░░█████████     █████    █████ ░░████
  #   ░░░░░░░░░     ░░░░░    ░░░░░   ░░░░
  #  ███████████ █████   █████ ██████████ ██████   ██████ ██████████
  # ░█░░░███░░░█░░███   ░░███ ░░███░░░░░█░░██████ ██████ ░░███░░░░░█
  # ░   ░███  ░  ░███    ░███  ░███  █ ░  ░███░█████░███  ░███  █ ░
  #     ░███     ░███████████  ░██████    ░███░░███ ░███  ░██████
  #     ░███     ░███░░░░░███  ░███░░█    ░███ ░░░  ░███  ░███░░█
  #     ░███     ░███    ░███  ░███ ░   █ ░███      ░███  ░███ ░   █
  #     █████    █████   █████ ██████████ █████     █████ ██████████
  #    ░░░░░    ░░░░░   ░░░░░ ░░░░░░░░░░ ░░░░░     ░░░░░ ░░░░░░░░░░

  # Dark GTK theme versions are usually named with a '-dark' suffix.
  # This is however not a fixed rule. If you added a theme on your own,
  # and it's not working as expected, please check first if your theme names
  # are spelled correctly (names must not contain spaces!).

  # UI --------------------------------------------------------------------------
  # Configure your GTK themes here. Uncomment a theme pair or add your own:

  ui_light = Adwaita
  ui_dark = Adwaita-dark

  #ui_light = Breeze
  #ui_dark = Breeze-Dark

  #ui_light = Greybird
  #ui_dark = Greybird-dark

  # ICONS -----------------------------------------------------------------------
  # Must be set. If you don't want to switch icon themes, then set the same name
  # for both 'icon_light' and 'icon_dark':

  icon_light = Papirus-Light
  icon_dark = Papirus-Dark

  #icon_light = breeze
  #icon_dark = breeze-dark

  #icon_light = Paper
  #icon_dark = Paper

  # BACKEND ---------------------------------------------------------------------
  # Set your preferred backend. If one doesn't do anything, try the other.
  # Use "xsettings" with the XFCE Desktop Environment. The package 'xfconf'
  # should have been installed along with XFCE.
  # Or uncomment "gsettings" if you are using the GNOME Desktop Environment,
  # and/or Wayland rather than Xorg:

  backend = xsettings
  #backend = gsettings
#+end_src

