blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html
<div id="outline-container-orgaecb6e3" class="outline-3">
<h3 id="orgaecb6e3"><a href="#orgaecb6e3">Let&rsquo;s design a beautiful Config File!</a></h3>
<div class="outline-text-3" id="text-orgaecb6e3">
<p>
Most important is a huge impressive ASCII art banner to show off your prowess. Besides that, it’s probably a good idea to provide some comments how to use the file. And then there are the actual preferences. Here you go:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>File <code>/home/YOUR_USER_NAME/.config/switch_gtk_theme.conf</code></label><pre class="src src-conf"><span class="org-comment-delimiter">#   </span><span class="org-comment">&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9608;&#9608;&#9608;   &#9617;&#9608;&#9608;&#9608;  &#9617;&#9617;&#9608;&#9608;&#9608; &#9617;&#9617;&#9608;&#9608;&#9608; &#9617;&#9608;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9608;  &#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9608;&#9608;&#9608;   &#9617;&#9617;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;&#9608;&#9608;&#9608;    &#9617;&#9617;&#9617;  &#9617;&#9608;&#9608;&#9608;   &#9617;&#9608;&#9608;&#9608;   &#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608; &#9617;   &#9617;&#9608;&#9608;&#9608;  &#9617;  &#9608;&#9608;&#9608;     &#9617;&#9617;&#9617;  &#9617;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;   &#9617;&#9608;&#9608;&#9608;   &#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;          &#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608; &#9617;&#9617;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;   &#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;          &#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;  &#9617;&#9617;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9617;    &#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;    &#9617;&#9617;&#9608;&#9608;&#9608;     &#9608;&#9608;&#9608; &#9617;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;     &#9617;&#9617;&#9608;&#9608;&#9608; &#9617;&#9617;&#9608;&#9608;&#9608;      &#9608;&#9608;&#9608;&#9608;&#9608;    &#9608;&#9608;&#9608;&#9608;&#9608;    &#9617;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;       &#9617;&#9617;&#9617;   &#9617;&#9617;&#9617;      &#9617;&#9617;&#9617;&#9617;&#9617;    &#9617;&#9617;&#9617;&#9617;&#9617;      &#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;  &#9617;&#9617;&#9617;&#9617;&#9617;   &#9617;&#9617;&#9617;&#9617;&#9617;</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9608;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9608;&#9617;&#9617;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9617;</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">&#9608;&#9608;&#9608;     &#9617;&#9617;&#9617; &#9617;   &#9617;&#9608;&#9608;&#9608;  &#9617;  &#9617;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;&#9608;&#9608;&#9608;             &#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;&#9608;&#9608;&#9608;    &#9608;&#9608;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;&#9617;&#9608;&#9608;&#9608;  &#9617;&#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608; &#9617;&#9617;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">&#9617;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;     &#9608;&#9608;&#9608;&#9608;&#9608;    &#9608;&#9608;&#9608;&#9608;&#9608; &#9617;&#9617;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;     &#9617;&#9617;&#9617;&#9617;&#9617;    &#9617;&#9617;&#9617;&#9617;&#9617;   &#9617;&#9617;&#9617;&#9617;</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;&#9608;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9608;&#9617;&#9617;&#9608;&#9608;&#9608;   &#9617;&#9617;&#9608;&#9608;&#9608; &#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;&#9617;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608; &#9617;&#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9617;   &#9617;&#9608;&#9608;&#9608;  &#9617;  &#9617;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;  &#9608; &#9617;  &#9617;&#9608;&#9608;&#9608;&#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;  &#9608; &#9617;</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">&#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9608;&#9608;&#9608; &#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">&#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9617;&#9617;&#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9608;    &#9617;&#9608;&#9608;&#9608; &#9617;&#9617;&#9617;  &#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608;&#9617;&#9617;&#9608;</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">&#9617;&#9608;&#9608;&#9608;     &#9617;&#9608;&#9608;&#9608;    &#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608; &#9617;   &#9608; &#9617;&#9608;&#9608;&#9608;      &#9617;&#9608;&#9608;&#9608;  &#9617;&#9608;&#9608;&#9608; &#9617;   &#9608;</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">&#9608;&#9608;&#9608;&#9608;&#9608;    &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;     &#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">&#9617;&#9617;&#9617;&#9617;&#9617;    &#9617;&#9617;&#9617;&#9617;&#9617;   &#9617;&#9617;&#9617;&#9617;&#9617; &#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617; &#9617;&#9617;&#9617;&#9617;&#9617;     &#9617;&#9617;&#9617;&#9617;&#9617; &#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617;</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Dark GTK theme versions are usually named with a '-dark' suffix.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This is however not a fixed rule. If you added a theme on your own,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">and it's not working as expected, please check first if your theme names</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">are spelled correctly (names must not contain spaces!).</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">UI --------------------------------------------------------------------------</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Configure your GTK themes here. Uncomment a theme pair or add your own:</span>

<span class="org-variable-name">ui_light</span> = Adwaita
<span class="org-variable-name">ui_dark</span> = Adwaita-dark

<span class="org-comment-delimiter">#</span><span class="org-comment">ui_light = Breeze</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">ui_dark = Breeze-Dark</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">ui_light = Greybird</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">ui_dark = Greybird-dark</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">ICONS -----------------------------------------------------------------------</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Must be set. If you don't want to switch icon themes, then set the same name</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">for both 'icon_light' and 'icon_dark':</span>

<span class="org-variable-name">icon_light</span> = Papirus-Light
<span class="org-variable-name">icon_dark</span> = Papirus-Dark

<span class="org-comment-delimiter">#</span><span class="org-comment">icon_light = breeze</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">icon_dark = breeze-dark</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">icon_light = Paper</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">icon_dark = Paper</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">BACKEND ---------------------------------------------------------------------</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Set your preferred backend. If one doesn't do anything, try the other.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Use "xsettings" with the XFCE Desktop Environment. The package 'xfconf'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">should have been installed along with XFCE.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Or uncomment "gsettings" if you are using the GNOME Desktop Environment,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">and/or Wayland rather than Xorg:</span>

<span class="org-variable-name">backend</span> = xsettings
<span class="org-comment-delimiter">#</span><span class="org-comment">backend = gsettings</span>
</pre>
</div>
</div>
</div>
