blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org
** Where to put this Config File?

As per [[https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html][Freedesktop.org conventions]], config files for (desktop-)applications should be put under =$XDG_CONFIG_HOME=. That's an environment variable, referring to the the user's config directory. If this environment variable is not set, "a default equal to =$HOME/.config= should be used" (=$HOME= is another environment variable, but one that /is/ usually set. It points to the user’s home directory).

So that means we could name the config file =$HOME/.config/switch_gtk_theme.conf=. But in case the environment variable =$XDG_CONFIG_HOME= /is/ already set, we should make that the 1st choice, because it could happen that a user has customized the paths to his/her liking, and we should respect that. But for now we just put it under =$HOME/.config/switch_gtk_theme.conf= and are done with it.

** The Config File Path

On my laptop, my =$HOME= directory is =/home/dan=, and the config file is there: =/home/dan/.config/switch_gtk_theme.conf=.

But we want the program to find the config file, no matter what’s the user name like, right? So the path of the config file has to be built automatically from:

- the actual home directory of the user
- the rest of the path =/.config/switch_gtk_theme.conf=, which doesn’t change (by convention).

Using the =$HOME= environment variable, we can assemble the absolute path like this:

#+caption: Expression (in the toplevel)
#+begin_src ocaml
  Unix.getenv "HOME" ^ "/.config/switch_gtk_theme.conf";;
#+end_src

[[https://ocaml.org/api/Unix.html][~Unix.getenv~]] is a function that gets the value of an arbitrary environment variable and returns it as a string. This function is defined in the Unix module.

Before you can use a function from the Unix module, you probably have to ~#require "unix"~ in your OCaml toplevel to load the package ="unix"= which contains the [[https://www.ocaml.org/api/Unix.html][~Unix~]] module. A [[https://ocaml.org/learn/tutorials/modules.html][Module]] is a construct within the OCaml language, while a [[https://ocaml.org/packages][package]] is a bunch of files to install with [[https://opam.ocaml.org/][Opam (OCaml package manager)]]. They are different things. That can be confusing, since they have usually the same name. Hint: module names always begin with an uppercase letter, but packages usually with a lowercase letter.

The [[https://www.ocaml.org/api/Stdlib.html#VAL(^)][~^~]] operator concatenates two strings into one. Eventually, we’ll get an expression that assembles the path depending on the user’s home directory:

#+caption: Expression in the toplevel
#+begin_src ocaml
  let path = Unix.getenv "HOME" ^ "/.config/switch_gtk_theme.conf";;
#+end_src

* Reading a Config File in OCaml

Ok fine, we’re going to read a file. What's going to happen with it when we've done that? What will it become? And how will it look like? And why all that?

“Reading a file” gives quite an imprecise description about what is actually going to happen. You know, it’s not about the file, but about the /data/ in it.

What we actually do: extract the data from one storage format (file) that resides on the disk and transform it into another storage format to store it in RAM — while maintaining the general structure of the data, or even better: enhancing the structure of the data to make it easier to handle. ’Handle’ means to pick specific parts from it, filter it, change it, etc.

And when a program has to handle some data, that also means there’s probably some kind of /data structure/ involved. Most programming languages provide some basic data structures to work with; eg. lists, dictionaries, tuples, records, etc.

In fact, our theme switcher needs only the key-value pairs like ~ui_light = Adwaita~ or ~icon_light = Papirus-Light~. Everything else is useless. So here’s a plan:

1. We’ll deal with the file on the disk to get the data out
2. We put the data into a data structure
3. We manipulate the data until it’s only left what the program needs
4. Eventually, we feed that into the switch mechanism to control it

