blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html
<div id="outline-container-org2a82cf4" class="outline-3">
<h3 id="org2a82cf4"><a href="#org2a82cf4">Where to put this Config File?</a></h3>
<div class="outline-text-3" id="text-org2a82cf4">
<p>
As per <a href="https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html">Freedesktop.org conventions</a>, config files for (desktop-)applications should be put under <code>$XDG_CONFIG_HOME</code>. That&rsquo;s an environment variable, referring to the the user&rsquo;s config directory. If this environment variable is not set, &ldquo;a default equal to <code>$HOME/.config</code> should be used&rdquo; (<code>$HOME</code> is another environment variable, but one that <i>is</i> usually set. It points to the user’s home directory).<br>
</p>

<p>
So that means we could name the config file <code>$HOME/.config/switch_gtk_theme.conf</code>. But in case the environment variable <code>$XDG_CONFIG_HOME</code> <i>is</i> already set, we should make that the 1st choice, because it could happen that a user has customized the paths to his/her liking, and we should respect that. But for now we just put it under <code>$HOME/.config/switch_gtk_theme.conf</code> and are done with it.<br>
</p>
</div>
</div>
<div id="outline-container-orga24ce54" class="outline-3">
<h3 id="orga24ce54"><a href="#orga24ce54">The Config File Path</a></h3>
<div class="outline-text-3" id="text-orga24ce54">
<p>
On my laptop, my <code>$HOME</code> directory is <code>/home/dan</code>, and the config file is there: <code>/home/dan/.config/switch_gtk_theme.conf</code>.<br>
</p>

<p>
But we want the program to find the config file, no matter what’s the user name like, right? So the path of the config file has to be built automatically from:<br>
</p>

<ul class="org-ul">
<li>the actual home directory of the user<br></li>
<li>the rest of the path <code>/.config/switch_gtk_theme.conf</code>, which doesn’t change (by convention).<br></li>
</ul>

<p>
Using the <code>$HOME</code> environment variable, we can assemble the absolute path like this:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Expression (in the toplevel)</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-module">Unix.</span>getenv <span class="org-string">"HOME"</span> <span class="org-tuareg-font-lock-operator">^</span> <span class="org-string">"/.config/switch_gtk_theme.conf"</span><span class="org-tuareg-font-double-semicolon">;;</span>
</pre>
</div>

<p>
<a href="https://ocaml.org/api/Unix.html"><code>Unix.getenv</code></a> is a function that gets the value of an arbitrary environment variable and returns it as a string. This function is defined in the Unix module.<br>
</p>

<p>
Before you can use a function from the Unix module, you probably have to <code>#require "unix"</code> in your OCaml toplevel to load the package <code>"unix"</code> which contains the <a href="https://www.ocaml.org/api/Unix.html"><code>Unix</code></a> module. A <a href="https://ocaml.org/learn/tutorials/modules.html">Module</a> is a construct within the OCaml language, while a <a href="https://ocaml.org/packages">package</a> is a bunch of files to install with <a href="https://opam.ocaml.org/">Opam (OCaml package manager)</a>. They are different things. That can be confusing, since they have usually the same name. Hint: module names always begin with an uppercase letter, but packages usually with a lowercase letter.<br>
</p>

<p>
The <a href="https://www.ocaml.org/api/Stdlib.html#VAL(%5E)"><code>^</code></a> operator concatenates two strings into one. Eventually, we’ll get an expression that assembles the path depending on the user’s home directory:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Expression in the toplevel</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">path</span> = <span class="org-tuareg-font-lock-module">Unix.</span>getenv <span class="org-string">"HOME"</span> <span class="org-tuareg-font-lock-operator">^</span> <span class="org-string">"/.config/switch_gtk_theme.conf"</span><span class="org-tuareg-font-double-semicolon">;;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7b3259e" class="outline-2">
<h2 id="org7b3259e"><a href="#org7b3259e">Reading a Config File in OCaml</a></h2>
<div class="outline-text-2" id="text-org7b3259e">
<p>
Ok fine, we’re going to read a file. What&rsquo;s going to happen with it when we&rsquo;ve done that? What will it become? And how will it look like? And why all that?<br>
</p>

<p>
“Reading a file” gives quite an imprecise description about what is actually going to happen. You know, it’s not about the file, but about the <i>data</i> in it.<br>
</p>

<p>
What we actually do: extract the data from one storage format (file) that resides on the disk and transform it into another storage format to store it in RAM — while maintaining the general structure of the data, or even better: enhancing the structure of the data to make it easier to handle. ’Handle’ means to pick specific parts from it, filter it, change it, etc.<br>
</p>

<p>
And when a program has to handle some data, that also means there’s probably some kind of <i>data structure</i> involved. Most programming languages provide some basic data structures to work with; eg. lists, dictionaries, tuples, records, etc.<br>
</p>

<p>
In fact, our theme switcher needs only the key-value pairs like <code>ui_light = Adwaita</code> or <code>icon_light = Papirus-Light</code>. Everything else is useless. So here’s a plan:<br>
</p>

<ol class="org-ol">
<li>We’ll deal with the file on the disk to get the data out<br></li>
<li>We put the data into a data structure<br></li>
<li>We manipulate the data until it’s only left what the program needs<br></li>
<li>Eventually, we feed that into the switch mechanism to control it<br></li>
</ol>
</div>
