blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org
** Getting the Data from the File

According to the [[https://www.ocaml.org/learn/tutorials/file_manipulation.html#Reading][official tutorial]], we’ll have to open an =in_channel= first, using the function [[https://ocaml.org/api/Stdlib.html#VALopen_in][~open_in~]]. An =in_channel= is not a file itself, but more like a tornado; its funnel's end at your disposal, pointing initially to the beginning of a file. Yeah programming is exciting. You probably know that already.

The =in_channel= can be “consumed”. That means we can e.g. read character by character, or line by line – and each time we have done so, the =in_channel= points to the next thing, until we reach the end of the file. When that happens, it’s not possible to read from that channel any more (in order to do so, we would have to re-open it again).

We can read a line from the =in_channel= using the function [[https://ocaml.org/api/Stdlib.html#VALinput_line][~input_line~]] (and bind a name ~line~ to it).

A channel needs to be closed when we’re done with it, using the function [[https://www.ocaml.org/api/Stdlib.html#VALclose_in][~close_in~]]. Only then the operating system will recognize this file as closed.

#+caption: Toplevel
#+begin_src ocaml
  (* 1. Assemble the path and bind it to the name [path] *)
  let path = (Unix.getenv "HOME" ^ "/.config/switch_gtk_theme.conf");;

  (* 2. Define the [in_channel] and bind it to the name [ic] *)
  let ic = open_in path;;

  (* 3. Read one line from the [in_channel] and bind it to the name [line] *)
  let line = input_line ic;;

  (* 4. Close the [in_channel] *)
  let _ = close_in ic;;
#+end_src

*What does the underscore ~_~ mean?* Well, that's the wildcard. We can use it in different places when we don't care to bind a name to the expression – e.g. when an expression is only evaluated for its side-effects, but we have no further use for the value it evaluates to (side-effect here is: closing the =in_channel=).

If the file exists and you got the path right, you’ll see this result:

#+caption: Result – the first line of the config file
#+begin_src ocaml
  val line : string =
    "#   █████████  █████   ███   █████ █████ ███████████   █████████  █████   █████"
#+end_src

Not so bad! But wasn’t our plan to ignore comments, starting with ~#~? Yes, we could do it either here, but also filter them out later, once the whole file is in memory. To get all the lines, [[https://ocaml.org/api/Stdlib.html#VALinput_line][~input_line~]] must be applied to the open =in_channel= over and over again – and with each time, another line is read, until the =in_channel= is consumed. Meanwhile all the resulting lines need to be collected somehow.

** Reading the whole File and building the Data Structure

To get all the lines, we must apply [[https://ocaml.org/api/Stdlib.html#VALinput_line][~input_line~]] repeatedly to the =in_channel=. In most other languages, repetition is done via loops. But loops are clumsy low-level made-up things, mutating variables in-place. Nonono, we don’t do that here. [[https://ocaml.org/learn/tutorials/if_statements_loops_and_recursion.html][In OCaml, we have cooler things: recursion]] – a function calling itself over and over again, until a base case is reached.

#+caption: File =switch_gtk_theme.ml=
#+begin_src ocaml
  (* 1. Assemble the path and bind it to the name [path] *)
  let path = (Unix.getenv "HOME" ^ "/.config/switch_gtk_theme.conf")

  (* 2. Define the [in_channel] and bind it to the name [ic] *)
  let ic = open_in path;;

  (* 3. Read one line from the [in_channel] and bind it to the name [line] *)
  let line = input_line ic;;

  (* 4. Close the [in_channel] *)
  let _ = close_in ic;;
#+end_src

#+begin_center
To be continued …
#+end_center
