blog/learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html
<div id="outline-container-org8e55ac0" class="outline-3">
<h3 id="org8e55ac0"><a href="#org8e55ac0">Getting the Data from the File</a></h3>
<div class="outline-text-3" id="text-org8e55ac0">
<p>
According to the <a href="https://www.ocaml.org/learn/tutorials/file_manipulation.html#Reading">official tutorial</a>, we’ll have to open an <code>in_channel</code> first, using the function <a href="https://ocaml.org/api/Stdlib.html#VALopen_in"><code>open_in</code></a>. An <code>in_channel</code> is not a file itself, but more like a tornado; its funnel&rsquo;s end at your disposal, pointing initially to the beginning of a file. Yeah programming is exciting. You probably know that already.<br>
</p>

<p>
The <code>in_channel</code> can be “consumed”. That means we can e.g. read character by character, or line by line – and each time we have done so, the <code>in_channel</code> points to the next thing, until we reach the end of the file. When that happens, it’s not possible to read from that channel any more (in order to do so, we would have to re-open it again).<br>
</p>

<p>
We can read a line from the <code>in_channel</code> using the function <a href="https://ocaml.org/api/Stdlib.html#VALinput_line"><code>input_line</code></a> (and bind a name <code>line</code> to it).<br>
</p>

<p>
A channel needs to be closed when we’re done with it, using the function <a href="https://www.ocaml.org/api/Stdlib.html#VALclose_in"><code>close_in</code></a>. Only then the operating system will recognize this file as closed.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Toplevel</label><pre class="src src-ocaml"><span class="org-comment-delimiter">(* </span><span class="org-comment">1. Assemble the path and bind it to the name [path]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">path</span> = <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tuareg-font-lock-module">Unix.</span>getenv <span class="org-string">"HOME"</span> <span class="org-tuareg-font-lock-operator">^</span> <span class="org-string">"/.config/switch_gtk_theme.conf"</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-tuareg-font-double-semicolon">;;</span>

<span class="org-comment-delimiter">(* </span><span class="org-comment">2. Define the [in_channel] and bind it to the name [ic]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">ic</span> = open_in path<span class="org-tuareg-font-double-semicolon">;;</span>

<span class="org-comment-delimiter">(* </span><span class="org-comment">3. Read one line from the [in_channel] and bind it to the name [line]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">line</span> = input_line ic<span class="org-tuareg-font-double-semicolon">;;</span>

<span class="org-comment-delimiter">(* </span><span class="org-comment">4. Close the [in_channel]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">_</span> = close_in ic<span class="org-tuareg-font-double-semicolon">;;</span>
</pre>
</div>

<p>
<b>What does the underscore <code>_</code> mean?</b> Well, that&rsquo;s the wildcard. We can use it in different places when we don&rsquo;t care to bind a name to the expression – e.g. when an expression is only evaluated for its side-effects, but we have no further use for the value it evaluates to (side-effect here is: closing the <code>in_channel</code>).<br>
</p>

<p>
If the file exists and you got the path right, you’ll see this result:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Result – the first line of the config file</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">val</span> <span class="org-function-name">line</span> : string =
  <span class="org-string">"#   &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608; &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;  &#9608;&#9608;&#9608;&#9608;&#9608;   &#9608;&#9608;&#9608;&#9608;&#9608;"</span>
</pre>
</div>

<p>
Not so bad! But wasn’t our plan to ignore comments, starting with <code>#</code>? Yes, we could do it either here, but also filter them out later, once the whole file is in memory. To get all the lines, <a href="https://ocaml.org/api/Stdlib.html#VALinput_line"><code>input_line</code></a> must be applied to the open <code>in_channel</code> over and over again – and with each time, another line is read, until the <code>in_channel</code> is consumed. Meanwhile all the resulting lines need to be collected somehow.<br>
</p>
</div>
</div>
<div id="outline-container-orgf4d3da3" class="outline-3">
<h3 id="orgf4d3da3"><a href="#orgf4d3da3">Reading the whole File and building the Data Structure</a></h3>
<div class="outline-text-3" id="text-orgf4d3da3">
<p>
To get all the lines, we must apply <a href="https://ocaml.org/api/Stdlib.html#VALinput_line"><code>input_line</code></a> repeatedly to the <code>in_channel</code>. In most other languages, repetition is done via loops. But loops are clumsy low-level made-up things, mutating variables in-place. Nonono, we don’t do that here. <a href="https://ocaml.org/learn/tutorials/if_statements_loops_and_recursion.html">In OCaml, we have cooler things: recursion</a> – a function calling itself over and over again, until a base case is reached.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>File <code>switch_gtk_theme.ml</code></label><pre class="src src-ocaml"><span class="org-comment-delimiter">(* </span><span class="org-comment">1. Assemble the path and bind it to the name [path]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">path</span> = <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tuareg-font-lock-module">Unix.</span>getenv <span class="org-string">"HOME"</span> <span class="org-tuareg-font-lock-operator">^</span> <span class="org-string">"/.config/switch_gtk_theme.conf"</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">(* </span><span class="org-comment">2. Define the [in_channel] and bind it to the name [ic]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">ic</span> = open_in path<span class="org-tuareg-font-double-semicolon">;;</span>

<span class="org-comment-delimiter">(* </span><span class="org-comment">3. Read one line from the [in_channel] and bind it to the name [line]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">line</span> = input_line ic<span class="org-tuareg-font-double-semicolon">;;</span>

<span class="org-comment-delimiter">(* </span><span class="org-comment">4. Close the [in_channel]</span><span class="org-comment-delimiter"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">_</span> = close_in ic<span class="org-tuareg-font-double-semicolon">;;</span>
</pre>
</div>

<div class="org-center">
<p>
To be continued …<br>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
